app/controllers/professional_controller.rb

SELECT  "user2s".* FROM "user2s"  WHERE "user2s"."id" = ? LIMIT 1  [["id", 1]]
SELECT "user2s".* FROM "user2s"
SELECT "networkings".* FROM "networkings"  WHERE "networkings"."network_connection_id" = 1 AND "networkings"."status" = 'accepted'
---
  def index
    @user = User2.find(session[:user_id])
    @alluser = User2.where.not(id:session[:user_id])
# show all user_id that has the session_id in "network_connection_id" column with pending "status"
    @invites = Networking.where(network_connection_id:session[:user_id], status: "pending")

SELECT  "networkings".* FROM "networkings"  WHERE "networkings"."id" = 1 LIMIT 1
UPDATE "networkings" SET "status" = ?, "updated_at" = ? WHERE "networkings"."id" = 1  [["status", "accepted"], ["updated_at", "2016-09-26 17:52:57.697971"]]
---
  def accepted
    # when you accept, the person that sent the request doesnt see the accepted request.....
    @accept = Networking.find_by(id: params[:id]).update(status: "accepted")

DELETE FROM "networkings" WHERE "networkings"."id" = ?  [["id", 48]]
SELECT  "networkings".* FROM "networkings"  WHERE "networkings"."user_id" = 3 AND "networkings"."network_connection_id" = 3 LIMIT 1
---
  def ignore
    Networking.find_by(user_id:session[:user_id], network_connection_id:params[:id]).destroy

DELETE FROM "networkings" WHERE "networkings"."id" = ?  [["id", 1]]
SELECT  "networkings".* FROM "networkings"  WHERE "networkings"."user_id" = 6 AND "networkings"."network_connection_id" IS NULL LIMIT 1
---
  def remove
    Networking.find_by(user_id:session[:user_id], network_connection_id:params[:id]).destroy

SELECT "user2s".* FROM "user2s"
SELECT "networkings"."network_connection_id" FROM "networkings"  WHERE "networkings"."user_id" = 2
SELECT "networkings"."network_connection_id" FROM "networkings"  WHERE ("networkings"."status" != 'pending')
---
  def show
    users = User2.all
    @networks = Networking.where(user_id: User2.find(session[:user_id])).pluck(:network_connection_id)
    @current = []

    users.each do |user|
      @current.push(user)
    end

    @alluser = User2.where.not(id:session[:user_id])
    @show = Networking.where.not(status: "pending").pluck(:network_connection_id)

INSERT INTO "networkings" ("created_at", "network_connection_id", "status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2016-09-26 17:52:34.034813"], ["network_connection_id", 1], ["status", "pending"], ["updated_at", "2016-09-26 17:52:34.034813"], ["user_id", 2]]
---
  def connecting
    Networking.create(user_id:session[:user_id], network_connection_id: params[:id], status:"pending")

SELECT  "user2s".* FROM "user2s"  WHERE "user2s"."id" = 1 LIMIT 1
---
  def showUser
    @alluser = User2.find_by(id:params[:id])